import React from 'react';
import { NavLink, useHistory, useRouteMatch } from "react-router-dom";
import { CustomLink } from '../../utils/CustomLink/CustomLink';
import classes from './footer.module.css';

/**
 * статичный компонент, возвращает JSX разметку
 * может принимать в виде пропсов стандартные HTML аттрибуты
 * @returns {JSX.Element}
 * @constructor
 */
export const Footer = (props) => {
    const history=useHistory();
    const route = useRouteMatch(history.location.pathname)
    return (
        <div className={'row'}>
            <div className={`col-12 ${classes.footer} ${props.className ? props.className : ''}`} {...props}>
                {/* кнопка для перехода на главную страницу */}

                <CustomLink route={route.path} exact={true} activeClassName={classes.item_active} className={classes.home} activeClassName={classes.home_active} to={'/'}>
                    <div className={classes.svg} />
                </CustomLink>

                {/* кнопка для перехода к отчетам*/}

                <CustomLink route={route.path} activeClassName={classes.item_active} className={classes.item} to={'/reports'}>
                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><path fillRule="evenodd" clipRule="evenodd" d="M12 20.9999C7.02944 20.9999 3 16.9705 3 11.9999C3 7.75232 5.94256 4.14578 9.90041 3.1923C10.4796 3.05276 11 3.52079 11 4.11657V10.9999C11 12.1045 11.8954 12.9999 13 12.9999H19.8834C20.4792 12.9999 20.9472 13.5203 20.8076 14.0995C19.8542 18.0574 16.2476 20.9999 12 20.9999ZM15 3.99994V8.99994H20C19.6667 7.33327 18.2 3.99994 15 3.99994Z" fill="#69707F" /><path d="M9.90041 3.1923L10.1346 4.16448L10.1346 4.16448L9.90041 3.1923ZM20.8076 14.0995L21.7798 14.3337V14.3337L20.8076 14.0995ZM15 8.99994H14C14 9.55222 14.4477 9.99994 15 9.99994V8.99994ZM15 3.99994V2.99994C14.4477 2.99994 14 3.44765 14 3.99994H15ZM20 8.99994V9.99994C20.2996 9.99994 20.5834 9.86561 20.7733 9.63393C20.9633 9.40224 21.0393 9.0976 20.9806 8.80382L20 8.99994ZM2 11.9999C2 17.5228 6.47715 21.9999 12 21.9999V19.9999C7.58172 19.9999 4 16.4182 4 11.9999H2ZM9.6662 2.22011C5.26441 3.28055 2 7.28485 2 11.9999H4C4 8.21979 6.62071 5.01102 10.1346 4.16448L9.6662 2.22011ZM12 4.11657C12 2.96743 10.9625 1.90782 9.6662 2.22011L10.1346 4.16448C10.1192 4.16819 10.0942 4.16944 10.067 4.16242C10.0418 4.15593 10.0249 4.14509 10.0156 4.13707C9.99871 4.12255 10 4.1123 10 4.11657H12ZM12 10.9999V4.11657H10V10.9999H12ZM13 11.9999C12.4477 11.9999 12 11.5522 12 10.9999H10C10 12.6568 11.3431 13.9999 13 13.9999V11.9999ZM19.8834 11.9999H13V13.9999H19.8834V11.9999ZM21.7798 14.3337C22.0921 13.0374 21.0325 11.9999 19.8834 11.9999V13.9999C19.8876 13.9999 19.8774 14.0012 19.8629 13.9843C19.8548 13.975 19.844 13.9581 19.8375 13.9329C19.8305 13.9057 19.8317 13.8807 19.8355 13.8653L21.7798 14.3337ZM12 21.9999C16.7151 21.9999 20.7194 18.7355 21.7798 14.3337L19.8355 13.8653C18.9889 17.3792 15.7802 19.9999 12 19.9999V21.9999ZM16 8.99994V3.99994H14V8.99994H16ZM20 7.99994H15V9.99994H20V7.99994ZM15 4.99994C16.2029 4.99994 17.1045 5.61115 17.785 6.488C18.4794 7.38289 18.8764 8.48104 19.0194 9.19605L20.9806 8.80382C20.7902 7.85217 20.2873 6.45032 19.365 5.26187C18.4288 4.05539 16.9971 2.99994 15 2.99994V4.99994Z" fill="#69707F" /></svg>
                    <span>отчеты</span>
                </CustomLink>

                {/* кнопка для перехода к списку сотрудников*/}

                <CustomLink route={route.path} activeClassName={classes.item_active} className={classes.item} to={'/staffs'}>
                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><path fillRule="evenodd" clipRule="evenodd" d="M17 5V6H19C20.6569 6 22 7.34315 22 9V12H17V11C17 10.4477 16.5523 10 16 10C15.4477 10 15 10.4477 15 11V12H9V11C9 10.4477 8.55228 10 8 10C7.44772 10 7 10.4477 7 11V12H2V9C2 7.34315 3.34315 6 5 6H7V5C7 3.34315 8.34315 2 10 2H14C15.6569 2 17 3.34315 17 5ZM15 15V14H9V15C9 15.5523 8.55228 16 8 16C7.44772 16 7 15.5523 7 15V14H2V19C2 20.6569 3.34315 22 5 22H19C20.6569 22 22 20.6569 22 19V14H17V15C17 15.5523 16.5523 16 16 16C15.4477 16 15 15.5523 15 15ZM11 4C10.4477 4 10 4.44772 10 5V6H14V5C14 4.44772 13.5523 4 13 4H11Z" fill="#69707F" /></svg>
                    <span>сотрудники</span>
                </CustomLink>

                {/* кнопка для перехода к списку клиентов*/}

                <CustomLink route={route.path} activeClassName={classes.item_active} className={classes.item} to={'/clients'}>
                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><path fillRule="evenodd" clipRule="evenodd" d="M3 9C3 5.68629 5.68629 3 9 3C12.3137 3 15 5.68629 15 9C15 10.9443 14.0752 12.6725 12.6415 13.769C15.1863 14.9067 17 17.2079 17 20C17 20.5523 16.5523 21 16 21H2C1.44772 21 1 20.5523 1 20C1 17.2079 2.81374 14.9067 5.35847 13.769C3.92478 12.6725 3 10.9443 3 9ZM22 21H18C18.5523 21 19 20.5523 19 20C19 17.2079 17.1863 14.9067 14.6415 13.769C16.0752 12.6725 17 10.9443 17 9C17 6.38756 15.3304 4.16508 13 3.34141C13.6256 3.12031 14.2987 3 15 3C18.3137 3 21 5.68629 21 9C21 10.9443 20.0752 12.6725 18.6415 13.769C21.1863 14.9067 23 17.2079 23 20C23 20.5523 22.5523 21 22 21Z" fill="#69707F" /></svg>
                    <span>клиенты</span>
                </CustomLink>

                {/* кнопка для перехода к настройкам */}

                <CustomLink route={route.path} activeClassName={classes.item_active} className={classes.item} to={'/settings'}>
                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><path fillRule="evenodd" clipRule="evenodd" d="M11 2C9.89543 2 9 2.89543 9 4V4.75733L8.29289 5.46444L9 4.75733L8.4645 4.22184C7.68346 3.44079 6.41712 3.44079 5.63608 4.22184L4.22186 5.63605C3.44081 6.4171 3.44081 7.68343 4.22186 8.46448L4.75739 9H4C2.89543 9 2 9.89543 2 11V13C2 14.1046 2.89543 15 4 15H4.75739L4.22185 15.5355C3.4408 16.3166 3.4408 17.5829 4.22185 18.364L5.63606 19.7782C6.41711 20.5592 7.68344 20.5592 8.46449 19.7782L7.75738 19.0711L8.46449 19.7782L9 19.2427V20C9 21.1046 9.89543 22 11 22H13C14.1046 22 15 21.1046 15 20V19.2426L15.5356 19.7782C16.3166 20.5592 17.583 20.5592 18.364 19.7782L19.7782 18.364C20.5593 17.5829 20.5593 16.3166 19.7782 15.5355L19.2427 15H20C21.1046 15 22 14.1046 22 13V11C22 9.89543 21.1046 9 20 9L19.2427 9L19.7782 8.46447C20.5592 7.68343 20.5592 6.4171 19.7782 5.63605L18.364 4.22183C17.5829 3.44078 16.3166 3.44078 15.5356 4.22183L15 4.75739V4C15 2.89543 14.1046 2 13 2H11ZM16 12C16 14.2091 14.2091 16 12 16C9.79086 16 8 14.2091 8 12C8 9.79086 9.79086 8 12 8C14.2091 8 16 9.79086 16 12ZM12 14C13.1046 14 14 13.1046 14 12C14 10.8954 13.1046 10 12 10C10.8954 10 10 10.8954 10 12C10 13.1046 10.8954 14 12 14Z" fill="#69707F" /></svg>
                    <span>настройки</span>
                </CustomLink>

            </div>

        </div>
    );
};