import React, { useState } from 'react';
import { DataPickerRange } from '../../../../utils/DataPickerRange/DataPickerRange';
import { OtherInput } from '../../../../utils/OtherInput/OtherInput';
import HeaderNav from '../../../common/HeaderNav';
import classes from './visit.module.css';

export const ProfileVisit = ({ profile }) => {

    const [date, setDate] = useState({
        from: '',
        to: ''
    })

    return (
        <>
            <div className={classes.wrapper_search}>
                <div className={classes.search_visit}>
                    <OtherInput label={'посещаемость'} />
                </div>
                <div className={classes.search_date}>
                    <DataPickerRange value={date} label={"за период"} />
                </div>
            </div>
            <div className={classes.wrapper_result}>
                <p className={classes.title}>история посещений</p>
                <div className={classes.wrapper_table}>
                    <p className={classes.table_caption}>Куплено абониментов: <span className={classes.table_period}>12</span></p>
                    <table className={classes.table}>
                        <thead>
                            <tr>
                                <th>&#x2116;</th>
                                <th>занятие</th>
                                <th>абонимент</th>
                                <th>статус</th>
                                <th>дата и время</th>
                                <th colSpan={2}>отмечен</th>
                            </tr>
                        </thead>
                        <tbody>
                            <tr>
                                <td>1000</td>
                                <td>Бразильское Джиу-Джитсу</td>
                                <td>NONSTOP</td>
                                <td>Брилиантовый</td>
                                <td>25.05.2021</td>
                                <td>
                                    <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg"><g clipPath="url(#clip0)"><path d="M6.00002 0.300049C2.69162 0.300049 1.61265e-05 2.72245 1.61265e-05 5.70005C1.61265e-05 6.74085 0.329216 7.74905 0.953616 8.62085C0.835416 9.92825 0.518616 10.8989 0.0586161 11.3587C-0.00218387 11.4194 -0.0173839 11.5125 0.0210161 11.5893C0.0550161 11.6579 0.125016 11.7001 0.200016 11.7001C0.209216 11.7001 0.218416 11.6995 0.227816 11.6981C0.308816 11.6867 2.19042 11.4159 3.55142 10.6303C4.32422 10.9421 5.14742 11.1001 6.00002 11.1001C9.30842 11.1001 12 8.67765 12 5.70005C12 2.72245 9.30842 0.300049 6.00002 0.300049Z" fill="#69707F" /></g><defs><clipPath id="clip0"><rect width="12" height="12" fill="white" /></clipPath></defs></svg>
                                    <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg"><circle cx="6" cy="6" r="6" fill="#43BF41" /></svg>
                                </td>
                            </tr>
                            <tr>
                                <td>1000</td>
                                <td>Бразильское Джиу-Джитсу</td>
                                <td>NONSTOP</td>
                                <td>Брилиантовый</td>
                                <td>25.05.2021</td>
                                <td colSpan={2}>
                                    <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg"><g clipPath="url(#clip0)"><path d="M6.00002 0.300049C2.69162 0.300049 1.61265e-05 2.72245 1.61265e-05 5.70005C1.61265e-05 6.74085 0.329216 7.74905 0.953616 8.62085C0.835416 9.92825 0.518616 10.8989 0.0586161 11.3587C-0.00218387 11.4194 -0.0173839 11.5125 0.0210161 11.5893C0.0550161 11.6579 0.125016 11.7001 0.200016 11.7001C0.209216 11.7001 0.218416 11.6995 0.227816 11.6981C0.308816 11.6867 2.19042 11.4159 3.55142 10.6303C4.32422 10.9421 5.14742 11.1001 6.00002 11.1001C9.30842 11.1001 12 8.67765 12 5.70005C12 2.72245 9.30842 0.300049 6.00002 0.300049Z" fill="#69707F" /></g><defs><clipPath id="clip0"><rect width="12" height="12" fill="white" /></clipPath></defs></svg>
                                    <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg"><circle cx="6" cy="6" r="6" fill="#43BF41" /></svg>
                                </td>
                            </tr>
                            <tr>
                                <td>1000</td>
                                <td>Бразильское Джиу-Джитсу</td>
                                <td>NONSTOP</td>
                                <td>Брилиантовый</td>
                                <td>25.05.2021</td>
                                <td>
                                    <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg"><g clipPath="url(#clip0)"><path d="M6.00002 0.300049C2.69162 0.300049 1.61265e-05 2.72245 1.61265e-05 5.70005C1.61265e-05 6.74085 0.329216 7.74905 0.953616 8.62085C0.835416 9.92825 0.518616 10.8989 0.0586161 11.3587C-0.00218387 11.4194 -0.0173839 11.5125 0.0210161 11.5893C0.0550161 11.6579 0.125016 11.7001 0.200016 11.7001C0.209216 11.7001 0.218416 11.6995 0.227816 11.6981C0.308816 11.6867 2.19042 11.4159 3.55142 10.6303C4.32422 10.9421 5.14742 11.1001 6.00002 11.1001C9.30842 11.1001 12 8.67765 12 5.70005C12 2.72245 9.30842 0.300049 6.00002 0.300049Z" fill="#69707F" /></g><defs><clipPath id="clip0"><rect width="12" height="12" fill="white" /></clipPath></defs></svg>
                                    <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg"><circle cx="6" cy="6" r="6" fill="#43BF41" /></svg>
                                </td>
                            </tr>
                            <tr>
                                <td>1000</td>
                                <td>Бразильское Джиу-Джитсу</td>
                                <td>NONSTOP</td>
                                <td>Брилиантовый</td>
                                <td>25.05.2021</td>
                                <td>
                                    <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg"><g clipPath="url(#clip0)"><path d="M6.00002 0.300049C2.69162 0.300049 1.61265e-05 2.72245 1.61265e-05 5.70005C1.61265e-05 6.74085 0.329216 7.74905 0.953616 8.62085C0.835416 9.92825 0.518616 10.8989 0.0586161 11.3587C-0.00218387 11.4194 -0.0173839 11.5125 0.0210161 11.5893C0.0550161 11.6579 0.125016 11.7001 0.200016 11.7001C0.209216 11.7001 0.218416 11.6995 0.227816 11.6981C0.308816 11.6867 2.19042 11.4159 3.55142 10.6303C4.32422 10.9421 5.14742 11.1001 6.00002 11.1001C9.30842 11.1001 12 8.67765 12 5.70005C12 2.72245 9.30842 0.300049 6.00002 0.300049Z" fill="#69707F" /></g><defs><clipPath id="clip0"><rect width="12" height="12" fill="white" /></clipPath></defs></svg>
                                    <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg"><circle cx="6" cy="6" r="6" fill="#43BF41" /></svg>
                                </td>
                            </tr>
                            <tr>
                                <td>1000</td>
                                <td>Бразильское Джиу-Джитсу</td>
                                <td>NONSTOP</td>
                                <td>Брилиантовый</td>
                                <td>25.05.2021</td>
                                <td>
                                    <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg"><g clipPath="url(#clip0)"><path d="M6.00002 0.300049C2.69162 0.300049 1.61265e-05 2.72245 1.61265e-05 5.70005C1.61265e-05 6.74085 0.329216 7.74905 0.953616 8.62085C0.835416 9.92825 0.518616 10.8989 0.0586161 11.3587C-0.00218387 11.4194 -0.0173839 11.5125 0.0210161 11.5893C0.0550161 11.6579 0.125016 11.7001 0.200016 11.7001C0.209216 11.7001 0.218416 11.6995 0.227816 11.6981C0.308816 11.6867 2.19042 11.4159 3.55142 10.6303C4.32422 10.9421 5.14742 11.1001 6.00002 11.1001C9.30842 11.1001 12 8.67765 12 5.70005C12 2.72245 9.30842 0.300049 6.00002 0.300049Z" fill="#69707F" /></g><defs><clipPath id="clip0"><rect width="12" height="12" fill="white" /></clipPath></defs></svg>
                                    <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg"><circle cx="6" cy="6" r="6" fill="#43BF41" /></svg>
                                </td>
                            </tr>
                            <tr>
                                <td>1000</td>
                                <td>Бразильское Джиу-Джитсу</td>
                                <td>NONSTOP</td>
                                <td>Брилиантовый</td>
                                <td>25.05.2021</td>
                                <td>
                                    <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg"><g clipPath="url(#clip0)"><path d="M6.00002 0.300049C2.69162 0.300049 1.61265e-05 2.72245 1.61265e-05 5.70005C1.61265e-05 6.74085 0.329216 7.74905 0.953616 8.62085C0.835416 9.92825 0.518616 10.8989 0.0586161 11.3587C-0.00218387 11.4194 -0.0173839 11.5125 0.0210161 11.5893C0.0550161 11.6579 0.125016 11.7001 0.200016 11.7001C0.209216 11.7001 0.218416 11.6995 0.227816 11.6981C0.308816 11.6867 2.19042 11.4159 3.55142 10.6303C4.32422 10.9421 5.14742 11.1001 6.00002 11.1001C9.30842 11.1001 12 8.67765 12 5.70005C12 2.72245 9.30842 0.300049 6.00002 0.300049Z" fill="#69707F" /></g><defs><clipPath id="clip0"><rect width="12" height="12" fill="white" /></clipPath></defs></svg>
                                    <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg"><circle cx="6" cy="6" r="6" fill="#43BF41" /></svg>
                                </td>
                            </tr>
                            <tr>
                                <td>1000</td>
                                <td>Бразильское Джиу-Джитсу</td>
                                <td>NONSTOP</td>
                                <td>Брилиантовый</td>
                                <td>25.05.2021</td>
                                <td>
                                    <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg"><g clipPath="url(#clip0)"><path d="M6.00002 0.300049C2.69162 0.300049 1.61265e-05 2.72245 1.61265e-05 5.70005C1.61265e-05 6.74085 0.329216 7.74905 0.953616 8.62085C0.835416 9.92825 0.518616 10.8989 0.0586161 11.3587C-0.00218387 11.4194 -0.0173839 11.5125 0.0210161 11.5893C0.0550161 11.6579 0.125016 11.7001 0.200016 11.7001C0.209216 11.7001 0.218416 11.6995 0.227816 11.6981C0.308816 11.6867 2.19042 11.4159 3.55142 10.6303C4.32422 10.9421 5.14742 11.1001 6.00002 11.1001C9.30842 11.1001 12 8.67765 12 5.70005C12 2.72245 9.30842 0.300049 6.00002 0.300049Z" fill="#69707F" /></g><defs><clipPath id="clip0"><rect width="12" height="12" fill="white" /></clipPath></defs></svg>
                                    <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg"><circle cx="6" cy="6" r="6" fill="#43BF41" /></svg>
                                </td>
                            </tr>
                            <tr>
                                <td>1000</td>
                                <td>Бразильское Джиу-Джитсу</td>
                                <td>NONSTOP</td>
                                <td>Брилиантовый</td>
                                <td>25.05.2021</td>
                                <td>
                                    <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg"><g clipPath="url(#clip0)"><path d="M6.00002 0.300049C2.69162 0.300049 1.61265e-05 2.72245 1.61265e-05 5.70005C1.61265e-05 6.74085 0.329216 7.74905 0.953616 8.62085C0.835416 9.92825 0.518616 10.8989 0.0586161 11.3587C-0.00218387 11.4194 -0.0173839 11.5125 0.0210161 11.5893C0.0550161 11.6579 0.125016 11.7001 0.200016 11.7001C0.209216 11.7001 0.218416 11.6995 0.227816 11.6981C0.308816 11.6867 2.19042 11.4159 3.55142 10.6303C4.32422 10.9421 5.14742 11.1001 6.00002 11.1001C9.30842 11.1001 12 8.67765 12 5.70005C12 2.72245 9.30842 0.300049 6.00002 0.300049Z" fill="#69707F" /></g><defs><clipPath id="clip0"><rect width="12" height="12" fill="white" /></clipPath></defs></svg>
                                    <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg"><circle cx="6" cy="6" r="6" fill="#43BF41" /></svg>
                                </td>
                            </tr>
                            <tr>
                                <td>1000</td>
                                <td>Бразильское Джиу-Джитсу</td>
                                <td>NONSTOP</td>
                                <td>Брилиантовый</td>
                                <td>25.05.2021</td>
                                <td>
                                    <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg"><g clipPath="url(#clip0)"><path d="M6.00002 0.300049C2.69162 0.300049 1.61265e-05 2.72245 1.61265e-05 5.70005C1.61265e-05 6.74085 0.329216 7.74905 0.953616 8.62085C0.835416 9.92825 0.518616 10.8989 0.0586161 11.3587C-0.00218387 11.4194 -0.0173839 11.5125 0.0210161 11.5893C0.0550161 11.6579 0.125016 11.7001 0.200016 11.7001C0.209216 11.7001 0.218416 11.6995 0.227816 11.6981C0.308816 11.6867 2.19042 11.4159 3.55142 10.6303C4.32422 10.9421 5.14742 11.1001 6.00002 11.1001C9.30842 11.1001 12 8.67765 12 5.70005C12 2.72245 9.30842 0.300049 6.00002 0.300049Z" fill="#69707F" /></g><defs><clipPath id="clip0"><rect width="12" height="12" fill="white" /></clipPath></defs></svg>
                                    <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg"><circle cx="6" cy="6" r="6" fill="#43BF41" /></svg>
                                </td>
                            </tr>
                            <tr>
                                <td>1000</td>
                                <td>Бразильское Джиу-Джитсу</td>
                                <td>NONSTOP</td>
                                <td>Брилиантовый</td>
                                <td>25.05.2021</td>
                                <td>
                                    <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg"><g clipPath="url(#clip0)"><path d="M6.00002 0.300049C2.69162 0.300049 1.61265e-05 2.72245 1.61265e-05 5.70005C1.61265e-05 6.74085 0.329216 7.74905 0.953616 8.62085C0.835416 9.92825 0.518616 10.8989 0.0586161 11.3587C-0.00218387 11.4194 -0.0173839 11.5125 0.0210161 11.5893C0.0550161 11.6579 0.125016 11.7001 0.200016 11.7001C0.209216 11.7001 0.218416 11.6995 0.227816 11.6981C0.308816 11.6867 2.19042 11.4159 3.55142 10.6303C4.32422 10.9421 5.14742 11.1001 6.00002 11.1001C9.30842 11.1001 12 8.67765 12 5.70005C12 2.72245 9.30842 0.300049 6.00002 0.300049Z" fill="#69707F" /></g><defs><clipPath id="clip0"><rect width="12" height="12" fill="white" /></clipPath></defs></svg>
                                    <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg"><circle cx="6" cy="6" r="6" fill="#43BF41" /></svg>
                                </td>
                            </tr>
                            <tr>
                                <td>1000</td>
                                <td>Бразильское Джиу-Джитсу</td>
                                <td>NONSTOP</td>
                                <td>Брилиантовый</td>
                                <td>25.05.2021</td>
                                <td>
                                    <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg"><g clipPath="url(#clip0)"><path d="M6.00002 0.300049C2.69162 0.300049 1.61265e-05 2.72245 1.61265e-05 5.70005C1.61265e-05 6.74085 0.329216 7.74905 0.953616 8.62085C0.835416 9.92825 0.518616 10.8989 0.0586161 11.3587C-0.00218387 11.4194 -0.0173839 11.5125 0.0210161 11.5893C0.0550161 11.6579 0.125016 11.7001 0.200016 11.7001C0.209216 11.7001 0.218416 11.6995 0.227816 11.6981C0.308816 11.6867 2.19042 11.4159 3.55142 10.6303C4.32422 10.9421 5.14742 11.1001 6.00002 11.1001C9.30842 11.1001 12 8.67765 12 5.70005C12 2.72245 9.30842 0.300049 6.00002 0.300049Z" fill="#69707F" /></g><defs><clipPath id="clip0"><rect width="12" height="12" fill="white" /></clipPath></defs></svg>
                                    <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg"><circle cx="6" cy="6" r="6" fill="#43BF41" /></svg>
                                </td>
                            </tr>
                            <tr>
                                <td>1000</td>
                                <td>Бразильское Джиу-Джитсу</td>
                                <td>NONSTOP</td>
                                <td>Брилиантовый</td>
                                <td>25.05.2021</td>
                                <td>
                                    <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg"><g clipPath="url(#clip0)"><path d="M6.00002 0.300049C2.69162 0.300049 1.61265e-05 2.72245 1.61265e-05 5.70005C1.61265e-05 6.74085 0.329216 7.74905 0.953616 8.62085C0.835416 9.92825 0.518616 10.8989 0.0586161 11.3587C-0.00218387 11.4194 -0.0173839 11.5125 0.0210161 11.5893C0.0550161 11.6579 0.125016 11.7001 0.200016 11.7001C0.209216 11.7001 0.218416 11.6995 0.227816 11.6981C0.308816 11.6867 2.19042 11.4159 3.55142 10.6303C4.32422 10.9421 5.14742 11.1001 6.00002 11.1001C9.30842 11.1001 12 8.67765 12 5.70005C12 2.72245 9.30842 0.300049 6.00002 0.300049Z" fill="#69707F" /></g><defs><clipPath id="clip0"><rect width="12" height="12" fill="white" /></clipPath></defs></svg>
                                    <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg"><circle cx="6" cy="6" r="6" fill="#43BF41" /></svg>
                                </td>
                            </tr>
                            <tr>
                                <td>1000</td>
                                <td>Бразильское Джиу-Джитсу</td>
                                <td>NONSTOP</td>
                                <td>Брилиантовый</td>
                                <td>25.05.2021</td>
                                <td>
                                    <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg"><g clipPath="url(#clip0)"><path d="M6.00002 0.300049C2.69162 0.300049 1.61265e-05 2.72245 1.61265e-05 5.70005C1.61265e-05 6.74085 0.329216 7.74905 0.953616 8.62085C0.835416 9.92825 0.518616 10.8989 0.0586161 11.3587C-0.00218387 11.4194 -0.0173839 11.5125 0.0210161 11.5893C0.0550161 11.6579 0.125016 11.7001 0.200016 11.7001C0.209216 11.7001 0.218416 11.6995 0.227816 11.6981C0.308816 11.6867 2.19042 11.4159 3.55142 10.6303C4.32422 10.9421 5.14742 11.1001 6.00002 11.1001C9.30842 11.1001 12 8.67765 12 5.70005C12 2.72245 9.30842 0.300049 6.00002 0.300049Z" fill="#69707F" /></g><defs><clipPath id="clip0"><rect width="12" height="12" fill="white" /></clipPath></defs></svg>
                                    <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg"><circle cx="6" cy="6" r="6" fill="#43BF41" /></svg>
                                </td>
                            </tr>
                            <tr>
                                <td>1000</td>
                                <td>Бразильское Джиу-Джитсу</td>
                                <td>NONSTOP</td>
                                <td>Брилиантовый</td>
                                <td>25.05.2021</td>
                                <td>
                                    <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg"><g clipPath="url(#clip0)"><path d="M6.00002 0.300049C2.69162 0.300049 1.61265e-05 2.72245 1.61265e-05 5.70005C1.61265e-05 6.74085 0.329216 7.74905 0.953616 8.62085C0.835416 9.92825 0.518616 10.8989 0.0586161 11.3587C-0.00218387 11.4194 -0.0173839 11.5125 0.0210161 11.5893C0.0550161 11.6579 0.125016 11.7001 0.200016 11.7001C0.209216 11.7001 0.218416 11.6995 0.227816 11.6981C0.308816 11.6867 2.19042 11.4159 3.55142 10.6303C4.32422 10.9421 5.14742 11.1001 6.00002 11.1001C9.30842 11.1001 12 8.67765 12 5.70005C12 2.72245 9.30842 0.300049 6.00002 0.300049Z" fill="#69707F" /></g><defs><clipPath id="clip0"><rect width="12" height="12" fill="white" /></clipPath></defs></svg>
                                    <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg"><circle cx="6" cy="6" r="6" fill="#43BF41" /></svg>
                                </td>
                            </tr>
                            <tr>
                                <td>1000</td>
                                <td>Бразильское Джиу-Джитсу</td>
                                <td>NONSTOP</td>
                                <td>Брилиантовый</td>
                                <td>25.05.2021</td>
                                <td>
                                    <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg"><g clipPath="url(#clip0)"><path d="M6.00002 0.300049C2.69162 0.300049 1.61265e-05 2.72245 1.61265e-05 5.70005C1.61265e-05 6.74085 0.329216 7.74905 0.953616 8.62085C0.835416 9.92825 0.518616 10.8989 0.0586161 11.3587C-0.00218387 11.4194 -0.0173839 11.5125 0.0210161 11.5893C0.0550161 11.6579 0.125016 11.7001 0.200016 11.7001C0.209216 11.7001 0.218416 11.6995 0.227816 11.6981C0.308816 11.6867 2.19042 11.4159 3.55142 10.6303C4.32422 10.9421 5.14742 11.1001 6.00002 11.1001C9.30842 11.1001 12 8.67765 12 5.70005C12 2.72245 9.30842 0.300049 6.00002 0.300049Z" fill="#69707F" /></g><defs><clipPath id="clip0"><rect width="12" height="12" fill="white" /></clipPath></defs></svg>
                                    <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg"><circle cx="6" cy="6" r="6" fill="#43BF41" /></svg>
                                </td>
                            </tr>
                        </tbody>
                    </table>
                </div>
            </div>
        </>
    );
};
